In [ ]:
#10. 行数のカウント
#ファイルの行数をカウントせよ。確認にはwcコマンドを用いよ。
with open("popular-names.txt",'r') as f:
    print(len(f.readlines()))        
import pandas as pd
data = pd.read_csv("popular-names.txt", sep='\t', header= None)
len(data)

#wc popular-names.txt -l

2780

2780

In [ ]:
#11. 先頭からN行を出力
#ファイルの先頭N行だけを表示せよ。例えば、N=10として先頭10行を表示せよ。確認にはheadコマンドを用いよ。
def show_first_n_lines(file_adr, n):
    with open(file_adr, 'r') as f:
        lines = f.readlines()
        print(''.join(lines[:n]))
file_adr = "popular-names.txt"
show_first_n_lines(file_adr, 10)
import pandas as pd
def show_first_n_lines(data, n):
    print(data[:n])
    print(data.head(n))
data = pd.read_csv("popular-names.txt", sep='\t', header= None)
show_first_n_lines(data, 10)

Mary	F	7065	1880
Anna	F	2604	1880
Emma	F	2003	1880
Elizabeth	F	1939	1880
Minnie	F	1746	1880
Margaret	F	1578	1880
Ida	F	1472	1880
Alice	F	1414	1880
Bertha	F	1320	1880
Sarah	F	1288	1880

           0  1     2     3
0       Mary  F  7065  1880
1       Anna  F  2604  1880
2       Emma  F  2003  1880
3  Elizabeth  F  1939  1880
4     Minnie  F  1746  1880
5   Margaret  F  1578  1880
6        Ida  F  1472  1880
7      Alice  F  1414  1880
8     Bertha  F  1320  1880
9      Sarah  F  1288  1880
           0  1     2     3
0       Mary  F  7065  1880
1       Anna  F  2604  1880
2       Emma  F  2003  1880
3  Elizabeth  F  1939  1880
4     Minnie  F  1746  1880
5   Margaret  F  1578  1880
6        Ida  F  1472  1880
7      Alice  F  1414  1880
8     Bertha  F  1320  1880
9      Sarah  F  1288  1880

In [37]:
#12. 末尾のN行を出力
#ファイルの末尾N行だけを表示せよ。例えば、N=10として末尾10行を表示せよ。確認にはtailコマンドを用いよ。
def show_last_n_lines(file_adr, n):
    with open(file_adr, 'r') as f:
        lines = f.readlines()
        print(''.join(lines[-n:]))
file_adr = "popular-names.txt"
show_last_n_lines(file_adr, 10)

import pandas as pd
def show_last_n_lines(file_adr, n):
    data = pd.read_csv(file_adr, sep = '\t', header=None)
    print(data.tail(n))
    print(data[-n:])
file_adr = "popular-names.txt"
show_last_n_lines(file_adr, 10)

Liam	M	19837	2018
Noah	M	18267	2018
William	M	14516	2018
James	M	13525	2018
Oliver	M	13389	2018
Benjamin	M	13381	2018
Elijah	M	12886	2018
Lucas	M	12585	2018
Mason	M	12435	2018
Logan	M	12352	2018

             0  1      2     3
2770      Liam  M  19837  2018
2771      Noah  M  18267  2018
2772   William  M  14516  2018
2773     James  M  13525  2018
2774    Oliver  M  13389  2018
2775  Benjamin  M  13381  2018
2776    Elijah  M  12886  2018
2777     Lucas  M  12585  2018
2778     Mason  M  12435  2018
2779     Logan  M  12352  2018
             0  1      2     3
2770      Liam  M  19837  2018
2771      Noah  M  18267  2018
2772   William  M  14516  2018
2773     James  M  13525  2018
2774    Oliver  M  13389  2018
2775  Benjamin  M  13381  2018
2776    Elijah  M  12886  2018
2777     Lucas  M  12585  2018
2778     Mason  M  12435  2018
2779     Logan  M  12352  2018

In [2]:
#13. タブをスペースに置換
#ファイルの先頭10行に対して、タブ1文字につきスペース1文字に置換して出力せよ。確認にはsedコマンド、trコマンド、もしくはexpandコマンドなどを用いよ。
import pandas as pd
data = pd.read_csv("popular-names.txt", sep = '\t',header = None)
data.head(10)

           0  1     2     3
0       Mary  F  7065  1880
1       Anna  F  2604  1880
2       Emma  F  2003  1880
3  Elizabeth  F  1939  1880
4     Minnie  F  1746  1880
5   Margaret  F  1578  1880
6        Ida  F  1472  1880
7      Alice  F  1414  1880
8     Bertha  F  1320  1880
9      Sarah  F  1288  1880

In [16]:
#14. 1列目を出力
#ファイルの先頭10行に対して、各行の1列目だけを抜き出して表示せよ。確認にはcutコマンドなどを用いよ。
import pandas as pd
data = pd.read_csv("popular-names.txt", sep = '\t',header = None)
data = data.head(10)
data[0]

0         Mary
1         Anna
2         Emma
3    Elizabeth
4       Minnie
5     Margaret
6          Ida
7        Alice
8       Bertha
9        Sarah
Name: 0, dtype: object

In [ ]:
#15. ファイルをN分割する
#ファイルを行単位でN分割し、別のファイルに格納せよ。例えば、N=10としてファイルを10分割せよ。同様の処理をsplitコマンドで実現せよ。
import pandas as pd
import math
data = pd.read_csv("popular-names.txt", sep = '\t',header = None)
def divide(data:pd, N):
    size = math.ceil(len(data) / N)      
    return [data.iloc[i*size:(i+1)*size] for i in range(N)]
# 分成10份
parts = divide(data, 10)
parts

[             0  1     2     3
 0         Mary  F  7065  1880
 1         Anna  F  2604  1880
 2         Emma  F  2003  1880
 3    Elizabeth  F  1939  1880
 4       Minnie  F  1746  1880
 ..         ... ..   ...   ...
 273     George  M  4320  1893
 274    Charles  M  3723  1893
 275     Joseph  M  2997  1893
 276      Frank  M  2917  1893
 277     Robert  M  2563  1893

 [278 rows x 4 columns],
             0  1      2     3
 278    Edward  M   2309  1893
 279     Harry  M   2245  1893
 280      Mary  F  13151  1894
 281      Anna  F   5565  1894
 282  Margaret  F   3700  1894
 ..        ... ..    ...   ...
 551   William  M   6904  1907
 552     James  M   6707  1907
 553    George  M   4445  1907
 554    Robert  M   4020  1907
 555   Charles  M   3884  1907

 [278 rows x 4 columns],
              0  1      2     3
 556     Joseph  M   3844  1907
 557      Frank  M   2943  1907
 558     Edward  M   2576  1907
 559      Henry  M   2203  1907
 560       Mary  F  18665  1908
 ..         ... ..    ...   ...
 829  Elizabeth  F  15800  1921
 830       John  M  58217  1921
 831     Robert  M  52784  1921
 832    William  M  51860  1921
 833      James  M  49748  1921

 [278 rows x 4 columns],
              0  1      2     3
 834    Charles  M  29244  1921
 835     George  M  27476  1921
 836     Joseph  M  26179  1921
 837     Edward  M  20818  1921
 838      Frank  M  16708  1921
 ...        ... ..    ...   ...
 1107  Margaret  F  14725  1935
 1108     Nancy  F  14544  1935
 1109     Helen  F  12781  1935
 1110    Robert  M  56524  1935
 1111     James  M  55000  1935

 [278 rows x 4 columns],
              0  1      2     3
 1112      John  M  47499  1935
 1113   William  M  40198  1935
 1114   Richard  M  33945  1935
 1115   Charles  M  29983  1935
 1116    Donald  M  29661  1935
 ...        ... ..    ...   ...
 1385    Sandra  F  30642  1949
 1386     Nancy  F  29246  1949
 1387     Carol  F  26783  1949
 1388  Kathleen  F  26354  1949
 1389    Sharon  F  25711  1949

 [278 rows x 4 columns],
              0  1      2     3
 1390     James  M  86857  1949
 1391    Robert  M  83872  1949
 1392      John  M  81161  1949
 1393   William  M  61501  1949
 1394   Michael  M  60046  1949
 ...        ... ..    ...   ...
 1663     Karen  F  32485  1963
 1664     Linda  F  27719  1963
 1665     Donna  F  25399  1963
 1666  Patricia  F  25371  1963
 1667      Lori  F  23907  1963

 [278 rows x 4 columns],
             0  1      2     3
 1668   Sandra  F  21619  1963
 1669  Cynthia  F  21593  1963
 1670  Michael  M  83782  1963
 1671     John  M  78625  1963
 1672    David  M  78467  1963
 ...       ... ..    ...   ...
 1941  Melissa  F  26886  1977
 1942      Amy  F  26732  1977
 1943  Jessica  F  24843  1977
 1944  Heather  F  23777  1977
 1945   Angela  F  20996  1977

 [278 rows x 4 columns],
              0  1      2     3
 1946  Michelle  F  19539  1977
 1947  Kimberly  F  18286  1977
 1948    Amanda  F  18280  1977
 1949     Kelly  F  18235  1977
 1950   Michael  M  67616  1977
 ...        ... ..    ...   ...
 2219    Joseph  M  30128  1990
 2220    Ashley  F  43478  1991
 2221   Jessica  F  43398  1991
 2222  Brittany  F  29089  1991
 2223    Amanda  F  28893  1991

 [278 rows x 4 columns],
                 0  1      2     3
 2224     Samantha  F  25645  1991
 2225        Sarah  F  25225  1991
 2226    Stephanie  F  22774  1991
 2227     Jennifer  F  20673  1991
 2228    Elizabeth  F  20392  1991
 ...           ... ..    ...   ...
 2497      William  M  20225  2004
 2498       Joseph  M  20125  2004
 2499  Christopher  M  19630  2004
 2500        Emily  F  23940  2005
 2501         Emma  F  20344  2005

 [278 rows x 4 columns],
              0  1      2     3
 2502   Madison  F  19568  2005
 2503   Abigail  F  15749  2005
 2504    Olivia  F  15693  2005
 2505  Isabella  F  15186  2005
 2506    Hannah  F  14845  2005
 ...        ... ..    ...   ...
 2775  Benjamin  M  13381  2018
 2776    Elijah  M  12886  2018
 2777     Lucas  M  12585  2018
 2778     Mason  M  12435  2018
 2779     Logan  M  12352  2018

 [278 rows x 4 columns]]

In [37]:
#16. ランダムに各行を並び替える
#ファイルを行単位でランダムに並び替えよ（注意: 各行の内容は変更せずに並び替えよ）。同様の処理をshufコマンドで実現せよ。
import pandas as pd
data = pd.read_csv("popular-names.txt", sep = '\t',header = None)
data.sample(frac = 1, random_state = None).reset_index(drop = True)

             0  1      2     3
0         Anna  F   3860  1884
1        David  M  82578  1958
2        Ethel  F   3896  1900
3     Margaret  F   6096  1906
4      Melissa  F  21727  1968
...        ... ..    ...   ...
2775      Mary  F   7065  1880
2776    Amanda  F  39457  1988
2777     Betty  F  22074  1940
2778    George  M  18195  1936
2779    Edward  M  18535  1919

[2780 rows x 4 columns]

In [43]:
#17. １列目の文字列の異なり
#1列目の文字列の異なり（文字列の種類）を求めよ。確認にはcut, sort, uniqコマンドを用いよ。
import pandas as pd
data = pd.read_csv("popular-names.txt", sep = '\t',header = None)
print(data[0].unique())
len(data[0].unique())

['Mary' 'Anna' 'Emma' 'Elizabeth' 'Minnie' 'Margaret' 'Ida' 'Alice'
 'Bertha' 'Sarah' 'John' 'William' 'James' 'Charles' 'George' 'Frank'
 'Joseph' 'Thomas' 'Henry' 'Robert' 'Annie' 'Edward' 'Clara' 'Florence'
 'Ethel' 'Bessie' 'Harry' 'Helen' 'Ruth' 'Marie' 'Lillian' 'Mildred'
 'Dorothy' 'Frances' 'Walter' 'Evelyn' 'Virginia' 'Richard' 'Betty'
 'Donald' 'Doris' 'Shirley' 'Barbara' 'Patricia' 'Joan' 'Nancy' 'Carol'
 'David' 'Ronald' 'Judith' 'Linda' 'Sandra' 'Carolyn' 'Sharon' 'Michael'
 'Susan' 'Donna' 'Larry' 'Kathleen' 'Deborah' 'Gary' 'Karen' 'Debra'
 'Pamela' 'Cynthia' 'Mark' 'Steven' 'Lisa' 'Jeffrey' 'Lori' 'Kimberly'
 'Tammy' 'Angela' 'Michelle' 'Jennifer' 'Melissa' 'Christopher' 'Brian'
 'Amy' 'Laura' 'Tracy' 'Julie' 'Jason' 'Scott' 'Stephanie' 'Heather'
 'Nicole' 'Matthew' 'Rebecca' 'Jessica' 'Amanda' 'Daniel' 'Kelly' 'Joshua'
 'Crystal' 'Ashley' 'Megan' 'Brittany' 'Andrew' 'Justin' 'Samantha'
 'Lauren' 'Emily' 'Brandon' 'Tyler' 'Taylor' 'Nicholas' 'Jacob' 'Hannah'
 'Austin' 'Alexis' 'Rachel' 'Madison' 'Abigail' 'Olivia' 'Ethan' 'Anthony'
 'Isabella' 'Ava' 'Sophia' 'Chloe' 'Alexander' 'Mia' 'Jayden' 'Noah'
 'Aiden' 'Mason' 'Liam' 'Charlotte' 'Harper' 'Benjamin' 'Elijah' 'Amelia'
 'Logan' 'Oliver' 'Lucas']

136

In [50]:
#18. 各行の1列目の文字列の出現頻度を求め、出現頻度の高い順に並べる
#1列目の文字列の出現頻度を求め、出現頻度と名前を出現頻度の多い順に並べて表示せよ。確認にはcut, uniq, sortコマンドを用いよ。
import pandas as pd
data = pd.read_csv("popular-names.txt", sep = '\t',header = None)
freq = data[0].value_counts()
freq = freq.reset_index()
freq.columns = ["name", "count"]
freq.head(10)

        name  count
0      James    118
1    William    111
2     Robert    108
3       John    108
4       Mary     92
5    Charles     75
6    Michael     74
7  Elizabeth     73
8     Joseph     70
9   Margaret     60

In [ ]:
#19. 3列目の数値の降順に各行を並び替える
#3列目の数値の逆順でファイルの各行を整列せよ（注意: 各行の内容は変更せずに並び替えよ）。同様の処理をsortコマンドで実現せよ。
import pandas as pd
data = pd.read_csv("popular-names.txt", sep = '\t',header = None)
data.sort_values(by=2, ascending = False)

            0  1      2     3
1340    Linda  F  99689  1947
1360    Linda  F  96211  1948
1350    James  M  94757  1947
1550  Michael  M  92704  1957
1351   Robert  M  91640  1947
...       ... ..    ...   ...
27      Annie  F   1326  1881
28     Bertha  F   1324  1881
8      Bertha  F   1320  1880
29      Alice  F   1308  1881
9       Sarah  F   1288  1880

[2780 rows x 4 columns]